#+TITLE: Golang Gopath Gomod

#+EXPORT_FILE_NAME: go-interview
#+HUGO_WEIGHT: auto
#+HUGO_BASE_DIR: ~/G/blog
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_SECTION: notes
#+HUGO_CATEGORIES: notes
#+HUGO_TAGS: golang


* Create a New ~hello~ Module by Example

-> Example dir @ [[file:../src/gomod/hello/][Go Mod ~hello~ Example]]


- Create a new, empty directory somewhere outside ~$GOPATH/src~, ~cd~ into that
  directory, and then create a new source file, ~hello.go~:
#+BEGIN_SRC go :exports both
package hello

func Hello() string {
    return "Hello, world."
}
#+END_SRC
- Create a test, ~hello_test.go~
 
#+BEGIN_SRC go :exports both
package hello

import "testing"

func TestHello(t *testing.T) {
	tests := []struct {
		name string
		want string
	}{
		{"Example 1", "Oh hawai, This is Hello Pkg."},
	}
	for _, tt := range tests {
		t.Run(tt.name, func(t *testing.T) {
			if got := Hello(); got != tt.want {
				t.Errorf("Hello() = %v, want %v", got, tt.want)
			}
		})
	}
}
#+END_SRC

#+BEGIN_SRC sh :exports both
go test
#+END_SRC

#+RESULTS:
#+begin_example
PASS
ok  	_/Users/eric/G/w/golangtour/src/gomod/hello	3.326s
#+end_example

The last line summarizes the overall package test. Because we are working
outside $GOPATH and also outside any module, the go command knows no import path
for the current directory and makes up a fake one based on the directory name:
_/Users/eric/G/w/golangtour/src/gomod/hello.

- Let's make the current directory the root of a module by using go mod init and
  then try go test again:

 #+BEGIN_SRC sh
 go mod init lroolle.com/hello
 #+END_SRC

- Run test again:
#+begin_example
PASS
ok      lroolle.com/hello       1.942s
#+end_example

- ~go.mod~ file

#+BEGIN_SRC sh
cat go.mod
#+END_SRC

#+RESULTS:
#+begin_example
module lroolle.com/hello

go 1.14
#+end_example

- Add a dependency:
#+BEGIN_SRC go :exports both
// hello.go
package hello

import "rsc.io/quote"

func Hello() string {
    return quote.Hello()
}
#+END_SRC

#+RESULTS:
#+begin_example
// go test
go: finding module for package rsc.io/quote
go: downloading rsc.io/quote v1.5.2
go: found rsc.io/quote in rsc.io/quote v1.5.2
go: downloading rsc.io/sampler v1.3.0
go: downloading golang.org/x/text v0.0.0-20170915032832-14c0d48ead0c
--- FAIL: TestHello (0.00s)
    --- FAIL: TestHello/Example_1 (0.00s)
        hello_test.go:15: Hello() = Hello, world., want Oh hawai, This is Hello Pkg.
FAIL
exit status 1
FAIL	lroolle.com/hello	1.402s

Compilation exited abnormally with code 1 at Mon Jul 27 17:15:02
#+end_example

The go command resolves imports by using the specific dependency module versions
listed in ~go.mod~. When it encounters an import of a package not provided by any
module in ~go.mod~, the go command automatically looks up the module containing
that package and adds it to go.mod, using the latest version. (“Latest” is
defined as the latest tagged stable (non-prerelease) version, or else the latest
tagged prerelease version, or else the latest untagged version.)

- List current modules and dependencys

-> see godoc @[[https://golang.org/cmd/go/#hdr-Pseudo_versions][Pseudo_versions]]
#+begin_example
// go list -m all
lroolle.com/hello
golang.org/x/text v0.0.0-20170915032832-14c0d48ead0c
rsc.io/quote v1.5.2
rsc.io/sampler v1.3.0
#+end_example

- ~go.sum~
  go.sum containing the expected cryptographic hashes of the content of
  specific module versions

  The go command uses the go.sum file to ensure that future downloads of these
  modules retrieve the same bits as the first download, to ensure the modules
  your project depends on do not change unexpectedly, whether for malicious,
  accidental, or other reasons. Both go.mod and go.sum should be checked into
  version control.

